/* ====================== ЗАПОЛНЕНИЕ ТАБЛИЦ ====================== */

INSERT INTO exam_session.student (surname, name, patronymic, birthdate) 
VALUES ('Иванов', 'Иван', 'Иванович', '2000-05-15'),
	   ('Орлова', 'Ольга', 'Игоревна', '2001-09-03'),
	   ('Васнецов', 'Артем', 'Андреевич', '1999-02-18');

INSERT INTO exam_session.student (surname, name, birthdate) 
VALUES ('Иванова', 'Василиса', '2002-06-12'),
	   ('Лебедев', 'Павел', '2000-04-17');

INSERT INTO exam_session.teacher (surname, name, patronymic) 
VALUES ('Кузнецова', 'Елена', 'Михайловна'),
       ('Попов', 'Сергей', 'Александрович');

INSERT INTO exam_session.teacher (surname, name) 
VALUES ('Морозов', 'Дмитрий'),
       ('Весёлый', 'Кирилл');

INSERT INTO exam_session.subject (name, term, teacher_id) 
VALUES ('Математический анализ', 1, 1),
	   ('Программирование на C++', 1, 2),
	   ('Базы данных', 1, 3),
	   ('Операционные системы', 2, 4),
	   ('Теория вероятностей', 2, 1),
	   ('Web-программирование', 2, 2),
	   ('Алгоритмы и структуры данных', 2, 1),
	   ('Искусственный интеллект', 3, 4),
	   ('Машинное обучение', 3, 3);

INSERT INTO exam_session.grade (student_id, subject_id, grade) 
VALUES (1, 1, 5), (1, 2, 5), (1, 3, 5),  			
	   (1, 4, 5), (1, 5, 5), (1, 6, 5), (1, 7, 5), 
	   (1, 8, 5), (1, 9, 5),  						
	   (2, 1, 4), (2, 2, 5), (2, 3, 4),  		
	   (2, 4, 4), (2, 5, 5), (2, 6, 4), (2, 7, 5),
	   (2, 8, 4), (2, 9, 5),					
	   (3, 1, 3), (3, 2, 4), (3, 3, 3),  		
	   (3, 4, 3), (3, 5, 4), (3, 6, 3), (3, 7, 4),
	   (3, 8, 3), (3, 9, 4),  					
	   (4, 1, 5), (4, 2, 4), (4, 3, 4),  		
	   (4, 4, 5), (4, 5, 3), (4, 6, 3), (4, 7, 5),
	   (4, 8, 4), (4, 9, 5),  					
	   (5, 1, 2), (5, 2, 5), (5, 3, 3),  		
	   (5, 4, 4), (5, 5, 2), (5, 6, 5), (5, 7, 3),
	   (5, 8, 5), (5, 9, 2);  					

/* ==================== РЕДАКТИРОВАНИЕ ЗАПИСЕЙ ==================== */

UPDATE exam_session.grade 
   SET grade = 3 
 WHERE grade = 2;

UPDATE exam_session.subject 
   SET teacher_id = 3 
 WHERE teacher_id = 4;

/* ======================= УДАЛЕНИЕ ЗАПИСИ ======================= */

DELETE FROM exam_session.teacher 
 WHERE teacher_id = 4;